{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[MASK]": 2,
      "a": 3,
      "b": 4,
      "c": 5,
      "d": 6,
      "e": 7,
      "f": 8,
      "g": 9,
      "h": 10,
      "i": 11,
      "j": 12,
      "k": 13,
      "l": 14,
      "m": 15,
      "n": 16,
      "o": 17,
      "p": 18,
      "q": 19,
      "r": 20,
      "s": 21,
      "t": 22,
      "u": 23,
      "v": 24,
      "w": 25,
      "x": 26,
      "y": 27,
      "z": 28
    },
    "merges": []
  }
}